cf_billing/Documents/бестУстановитьФормулуРасчетаТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестУстановитьФормулуРасчетаТочекУчетаНП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестУровниВложенностиРасчетныхСхем</xr:Item>
				<xr:Item>InformationRegister.бестФормулыРасчетаТочекУчетаНП</xr:Item>
				<xr:Item>InformationRegister.бестРасчетныеСпособыТочекУчетаНП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолеваяТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыРаспределенияОбъема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьИндивидуальноеПотребление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСхема</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьФормулуРасчетаТочекУчетаНП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределенияОстатка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаПриВыходеПУ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьИндивидуальноеПотребление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДолевогоРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СторнироватьОбъемИндивидуальногоПотребления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированныйОбъем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорнойКоэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СхемаПриВыводеПодчиненногоПУ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределенияОстатка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаПриВыходеПУ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьИндивидуальноеПотребление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДолевогоРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СторнироватьОбъемИндивидуальногоПотребления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестРасчетныеСпособыТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестРасчетныеСпособыТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасчетныйСпособ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестУровниВложенностиРасчетныхСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестУровниВложенностиРасчетныхСхем</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестСпособыРаспределенияДолевыхСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестСпособыРаспределенияДолевыхСхем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДолевоеРаспределение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноНагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноДоговорномуОбъему</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноНачисленномуОбъему</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОбъемуНачисленнойУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноРассчитанномуОбъему</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйОбъем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/бестУстановитьФормулуРасчетаТочекУчетаНП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет объекты расчета
//
Процедура МассивОбъектовРасчета() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестУстановитьФормулуРасчетаТочекУчетаНП.Организация КАК Организация,
	|	бестУстановитьФормулуРасчетаТочекУчетаНП.Район КАК Район,
	|	бестУстановитьФормулуРасчетаТочекУчетаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестУстановитьФормулуРасчетаТочекУчетаНП.Дата КАК ПериодРегистрации,
	|	бестУстановитьФормулуРасчетаТочекУчетаНП.ОбъектРасчета КАК ГоловнойОбъектРасчета,
	|	бестУстановитьФормулуРасчетаТочекУчетаНП.ОбъектРасчета.МКД КАК МКД,
	|	Субабоненты.ОбъектРасчета КАК ОбъектРасчета
	|ИЗ
	|	Документ.бестУстановитьФормулуРасчетаТочекУчетаНП КАК бестУстановитьФормулуРасчетаТочекУчетаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестУстановитьФормулуРасчетаТочекУчетаНП.ТочкиУчета КАК Субабоненты
	|		ПО бестУстановитьФормулуРасчетаТочекУчетаНП.Ссылка = Субабоненты.Ссылка
	|ГДЕ
	|	бестУстановитьФормулуРасчетаТочекУчетаНП.Ссылка = &Ссылка" ;
	
	ДополнительныеСвойства.Вставить("МассивОбъектов",Запрос.Выполнить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();
	энргДатаПоследнегоИзменения	= ТекущаяДата();
	
	ДополнительныеСвойства.Вставить("МассивОбъектовРасчета",Истина);
	

	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= КонецДня(ДатаФактическогоСобытия);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= МоментВремени();
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли; 
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки = ДанныеШапки();
	
	Актуальность = Истина;
	
	Если ВидОперации = Перечисления.бестВидыОпераций.бестУстановитьФормулуРасчетаТочекУчетаНП_НачислениеПоФормуле Тогда
		
		ПроверкаДублированияВТЧ("ТочкиУчета", Отказ);
		ПроверкаДублированияВТЧ("СхемаПриВыводеПодчиненногоПУ", Отказ);
		
		Набор  						= Движения.бестРасчетныеСпособыТочекУчетаНП;
		Запись  					= Набор.Добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);
		Запись.РасчетныйСпособ		= Истина;
		
		// уровень вложенности
		УровеньВложенности 			= УровеньВложенностиГоловнойТУ();
		Набор  						= Движения.бестУровниВложенностиРасчетныхСхем;
		Запись  					= Набор.Добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);
		Запись.Уровень				= УровеньВложенности;
		
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.бестУстановитьФормулуРасчетаТочекУчетаНП_ОтменаНачисленийПоФормуле Тогда
		
		Набор  						= Движения.бестРасчетныеСпособыТочекУчетаНП;
		Запись  					= Набор.Добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);
		Запись.РасчетныйСпособ		= Ложь;
		
		Актуальность = Ложь;
		
	КонецЕсли;
	
	Для Каждого стр из ТочкиУчета цикл
		Запись  									= Движения.бестФормулыРасчетаТочекУчетаНП.Добавить();
		Запись.Период 								= ?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата);
		Запись.Организация 							= Организация;
		Запись.Район 								= Район;
		Запись.ОбъектРасчета 						= ОбъектРасчета;
		Запись.Услуга		 						= Услуга;
		Запись.ГоловнаяТочкаУчета 					= ДолеваяТочкаУчета;
		Запись.ОбъектРасчетаСубабонента 			= стр.ОбъектРасчета;
		Запись.ТочкаУчетаСубабонента 				= стр.ТочкаУчета;
		Запись.УслугаСубабонента 					= стр.Услуга;
		Если ТипЗнч(стр.Договор) = Тип("СправочникСсылка.энргАбоненты") Тогда
			Запись.АбонентСубабонента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(стр.Договор, "КлючПомещения");
		КонецЕсли;
		Запись.СхемаПриВыводеПодчиненногоПУ			= Ложь;
		Запись.Актуальность 						= Актуальность;
		ЗаполнитьЗначенияСвойств(Запись, стр, , "ОбъектРасчета, Услуга"); 
		
	КонецЦикла;
	
	Для Каждого стр из СхемаПриВыводеПодчиненногоПУ цикл
		Запись  									= Движения.бестФормулыРасчетаТочекУчетаНП.Добавить();
		Запись.Период 								= ?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата);
		Запись.Организация 							= Организация;
		Запись.Район 								= Район;
		Запись.ОбъектРасчета 						= ОбъектРасчета;
		Запись.Услуга		 						= Услуга;
		Запись.ГоловнаяТочкаУчета 					= ДолеваяТочкаУчета;
		Запись.ОбъектРасчетаСубабонента 			= стр.ОбъектРасчета;
		Запись.ТочкаУчетаСубабонента 				= стр.ТочкаУчета;
		Запись.УслугаСубабонента 					= стр.Услуга;
		Запись.СхемаПриВыводеПодчиненногоПУ			= Истина;
		Запись.СпособРаспределения 					= стр.СпособРаспределения;
		Запись.Актуальность 						= Актуальность;
		Запись.Коэффициент	 						= стр.Коэффициент;
		Запись.УчитыватьИндивидуальноеПотребление	= стр.УчитыватьИндивидуальноеПотребление;
		Запись.КоэффициентДолевогоРаспределения	 	= стр.КоэффициентДолевогоРаспределения;
		Запись.СторнироватьОбъемИндивидуальногоПотребления 		= стр.СторнироватьОбъемИндивидуальногоПотребления;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("ОбъектРасчета",			ОбъектРасчета);
	ДанныеШапки.Вставить("ТочкаУчета",				ДолеваяТочкаУчета);	
	ДанныеШапки.Вставить("Услуга",					Услуга);	
	Возврат ДанныеШапки;	
КонецФункции

Функция УровеньВложенностиГоловнойТУ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестУровниВложенностиРасчетныхСхемСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестУровниВложенностиРасчетныхСхемСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестУровниВложенностиРасчетныхСхемСрезПоследних.Уровень КАК Уровень,
		|	бестУровниВложенностиРасчетныхСхемСрезПоследних.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.бестУровниВложенностиРасчетныхСхем.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Регистратор = &ОсновнаяСхема
		|				И Регистратор <> ЗНАЧЕНИЕ(Документ.бестУстановитьФормулуРасчетаТочекУчетаНП.ПустаяСсылка)) КАК бестУровниВложенностиРасчетныхСхемСрезПоследних";
		
		Запрос.УстановитьПараметр("ОбъектРасчетаСубабонента", ОбъектРасчета);
		Запрос.УстановитьПараметр("УслугаСубабонента", Услуга);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", КонецДня(Дата));
		Запрос.УстановитьПараметр("Район", Район);
		Запрос.УстановитьПараметр("ТочкаУчетаСубабонента", ДолеваяТочкаУчета);
		Запрос.УстановитьПараметр("ТекДок", Ссылка);
		Запрос.УстановитьПараметр("ОсновнаяСхема", ОсновнаяСхема);
		
		
		РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Если Выборка.Следующий() Тогда
		Уровень = Выборка.Уровень + 1 ;
		Возврат Уровень;
	КонецЕсли;
	
КонецФункции

Процедура ПроверкаДублированияВТЧ(ТЧ, Отказ) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ОбъектРасчета КАК ОбъектРасчета,
	|	Таблица.ТочкаУчета КАК ТочкаУчета,
	|	Таблица.Услуга КАК Услуга
	|ИЗ
	|	Документ.бестУстановитьФормулуРасчетаТочекУчетаНП." + ТЧ + " КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестУстановитьФормулуРасчетаТочекУчетаНП." + ТЧ + " КАК Таблица1
	|		ПО (Таблица.Ссылка = &Ссылка)
	|			И Таблица.НомерСтроки <> Таблица1.НомерСтроки
	|			И (Таблица1.Ссылка = &Ссылка)
	|			И Таблица.ОбъектРасчета = Таблица1.ОбъектРасчета
	|			И Таблица.ТочкаУчета = Таблица1.ТочкаУчета
	|			И Таблица.Услуга = Таблица1.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.НомерСтроки,
	|	Таблица.Услуга,
	|	Таблица.ТочкаУчета,
	|	Таблица.ОбъектРасчета
	|ИТОГИ ПО
	|	ТочкаУчета";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		ТекстСбщ = "";
		Если ЗначениеЗаполнено(Выборка.ТочкаУчета) Тогда
			ТекстСбщ	= "По точке учета " + Выборка.ТочкаУчета + " обнаружены дубли в строках: ";
			ВыборкаДетали = Выборка.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				ТекстСбщ	= ТекстСбщ + ВыборкаДетали.НомерСтроки + ";"	
			КонецЦикла;				
		КонецЕсли;
		Если НЕ ТекстСбщ = "" Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСбщ);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ТочкиУчета) Тогда 
		Отказ = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена основная схема");
	ИначеЕсли Не ЗначениеЗаполнено(ТочкиУчета) и ЗначениеЗаполнено(СхемаПриВыводеПодчиненногоПУ) Тогда 
		Отказ = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена основная схема");		
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ТочкиУчета) Тогда 
		Для Каждого СтрокаТЧ из ТочкиУчета цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Коэффициент) и НЕ ЗначениеЗаполнено(СтрокаТЧ.СпособРаспределения) и НЕ ЗначениеЗаполнено(СтрокаТЧ.КоэффициентДолевогоРаспределения) 
				и НЕ ЗначениеЗаполнено(СтрокаТЧ.ФиксированныйОбъем) и НЕ ЗначениеЗаполнено(СтрокаТЧ.СпособРаспределенияОстатка) Тогда
				Отказ 		= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнены поля распределения для данной ТУ",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].ТочкаУчета");				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.СпособРаспределения) и СтрокаТЧ.СпособРаспределения = ПредопределенноеЗначение("Перечисление.бестСпособыРаспределенияДолевыхСхем.ДолевоеРаспределение") и НЕ ЗначениеЗаполнено(СтрокаТЧ.КоэффициентДолевогоРаспределения) Тогда
				Отказ 		= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Коэффициент долевого распределения",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].КоэффициентДолевогоРаспределения");				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.СпособРаспределения) и СтрокаТЧ.СпособРаспределения = ПредопределенноеЗначение("Перечисление.бестСпособыРаспределенияДолевыхСхем.ФиксированныйОбъем") и НЕ ЗначениеЗаполнено(СтрокаТЧ.ФиксированныйОбъем) Тогда
				Отказ 		= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Фиксированный объем",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].ФиксированныйОбъем");				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаПриВыводеПодчиненногоПУ) Тогда 
		Для Каждого СтрокаТЧ из СхемаПриВыводеПодчиненногоПУ цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Коэффициент) и НЕ ЗначениеЗаполнено(СтрокаТЧ.СпособРаспределения) и НЕ ЗначениеЗаполнено(СтрокаТЧ.КоэффициентДолевогоРаспределения) 
				 и НЕ ЗначениеЗаполнено(СтрокаТЧ.СпособРаспределенияОстатка) Тогда
				Отказ 		= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнены поля распределения для данной ТУ",ЭтотОбъект,"СхемаПриВыводеПодчиненногоПУ["+(СтрокаТЧ.НомерСтроки-1)+"].ТочкаУчета");				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.СпособРаспределения) и СтрокаТЧ.СпособРаспределения = ПредопределенноеЗначение("Перечисление.бестСпособыРаспределенияДолевыхСхем.ДолевоеРаспределение") и НЕ ЗначениеЗаполнено(СтрокаТЧ.КоэффициентДолевогоРаспределения) Тогда
				Отказ 		= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Коэффициент долевого распределения",ЭтотОбъект,"СхемаПриВыводеПодчиненногоПУ["+(СтрокаТЧ.НомерСтроки-1)+"].КоэффициентДолевогоРаспределения");				
			КонецЕсли;
						
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
